"""
필터링된 이미지 속에서 글자(알파벳)가 몇 개인지 알아보는 프로그램을 만들어 보고자 한다. 
해당 필터는 이미지에서 글자인 부분은 `1`, 글자가 아닌 부분은 `0`으로 바꾼다고 한다.
한 개의 글자는 `1`이 상, 하, 좌, 우, 대각선으로 인접하여 서로 연결되어 있다. 
해당 필터를 적용 하여 만든 이미지가 입력으로 주어졌을 때, 입력 이미지 내의 글자의 개수를 return하는 함수 P3를 구현하라.  
"""
from typing import List

def P3(image:List[List[int]]):
    def dfs(grid, visited, m, n, i, j):
        if i < 0 or i >= m or j < 0 or j >= n or visited[i][j] == 1 or grid[i][j] == 0:
            return
        visited[i][j] = 1
        dfs(grid, visited, m, n, i-1, j) # 상 
        dfs(grid, visited, m, n, i+1, j) # 하
        dfs(grid, visited, m, n, i, j-1) # 좌
        dfs(grid, visited, m, n, i, j+1) # 우
        dfs(grid, visited, m, n, i+1, j-1) # 우상단
        dfs(grid, visited, m, n, i+1, j+1) # 우하단
        dfs(grid, visited, m, n, i-1, j-1) # 좌상단
        dfs(grid, visited, m, n, i-1, j+1) # 좌하단
        
    M, N = len(image), len(image[0])
    cnt = 0
    visited = [[0 for _ in range(N)] for _ in range(M)]
    for i in range(M):
        for j in range(N):
            if image[i][j] == 1 and visited[i][j] == 0:
                dfs(image, visited, M, N, i, j)
                cnt += 1
                
    return cnt

if __name__ == "__main__":
    image = [[0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0],  
             [0, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0],  
             [0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0],  
             [0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0],  
             [0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0],  
             [0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0],  
             [0, 1, 1, 1, 1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0],  
             [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],  
             [0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0],  
             [0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0],  
             [0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0],  
             [0, 0, 1, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0],  
             [0, 0, 0, 1, 1, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0],  
             [0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 1, 1, 0],  
             [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0]]
    
    print(P3(image))
